{
    "statuses": [
        {
            "name": 100,
            "title": "Continue Server Code (Продолжение кода сервера)",
            "description": "Код 100 Continue обозначает «нормальную работу». Он указывает, что пользователь сделал качественный запрос, и сервер начал его обрабатывать. Это временный код статуса HTTP, появляющийся лишь в тех отдельных случаях, когда пользователь ожидает окончательный ответ со стороны сервера. Он возникает только после отправки последнего пакета данных. Когда такой статус-код можно использовать? Это внутренний статус, бывают случаи, когда он не появляется, особенно если пользователю уже удалось получить некоторые данные из сервера. Это что-то похожее на месседж, в котором сообщается, что соединение установилось качественно, и вы можете зайти на сайт. Отправьте данные, но не забудьте закрыть дверь, когда вы закончите (подразумевается код окончательного ответа)."
        },
        {
            "name": 101,
            "title": "Switching Protocols (Переключение протоколов)",
            "description": "Вероятно, это один из простейших кодов сервера. Он означает, что пользователь попросил переключить используемый тип протокола, и веб-сервер согласился на такой шаг. Когда вы можете его применить? Если осуществляется переход на новую версию HTTP из старой версии протокола. Такой запрос будет выполняться только в том случае, если существует более подходящий протокол (другими словами, если есть более новая версия HTTP)."
        },
        {
            "name": 102,
            "title": "Processing (Обработка)",
            "description": "Поскольку запрос WebDAV (протокол передачи), кроме основного запроса может включать и ряд других подзапросов, подразумевая также и файловые операции, то для его выполнения может потребоваться больше времени. Когда можно использовать этот код? Он создается для того, чтобы уведомить пользователя и обнулить таймер. Дальше будет активировано ожидание следующей директивы в стандартном режиме, поскольку обработка запросов способна затянуться по времени."
        },
        {
            "name": 200,
            "title": "OK",
            "description": "Код состояния 200, наверное, является наиболее популярным, но в то же время очень неприметным в плане использования. Он указывает, что передача данных между сервером и пользователем подошла к завершению, и все прошло так, как должно. Когда этот код нужно использовать? Постоянно!"
        },
        {
            "name": 201,
            "title": "Created (Создан)",
            "description": "В связи с успешным выполнением запроса создался новый ресурс. К примеру, благодаря запросу юзера сгенерирован такой ранее не существующий веб-ресурс, как новая страница. Исходной сервер настроен так, что обязан создать ресурс еще до отправки 201 кода. Если документ не может быть сгенерирован своевременно, сервер использует в качестве альтернативы код 202 (принят)."
        },
        {
            "name": 202,
            "title": "Accepted (Принят)",
            "description": "Текущий запрос был передан в стадию обработки, но в силу объективных факторов является незавершенным. Запрос к серверу может быть не завершенным, это зависит от факта, успешно ли прошла обработка и не отклонили ли его. В каких случаях подобный ответ может быть использован? Когда сервер не в состоянии выполнять запрос в тот момент, когда он делается. Принудительное выполнение запроса не предусматривается, а клиент не должен ожидать пока сообщение будет передано окончательно, поскольку высока вероятность длительного процесса обработки."
        },
        {
            "name": 203,
            "title": "Non-Authoritative Information (Недостоверная информация)",
            "description": "Серверу удалось полностью обработать запрос, но передаваемые данные не были взяты из первостепенного источника (резервная копия, другой сервер и т. д.) и поэтому информация может быть нерелевантной. Этот код имеет большое сходство с 200 серверным ответом, но указывает, что данные не были получены из источника. Когда применяют подобный ответ сервера? Ним можно заменить 200 код, если отправитель имеет веские основания полагать, что заголовки ответов из внешнего источника отличаются от тех, которые были предоставлены исходным сервером."
        },
        {
            "name": 204,
            "title": "No Content (Нет контента)",
            "description": "Этот код является ответом сервера, который указывает, что запрос получили и поняли. Но при этом не существует данных, которые могут быть отправлены пользователю. В основном такой код используется для активации скриптов без необходимости внесения изменений в веб-документ. Нужно, чтобы указанный код не содержал основного сообщения, и он должен быть вставлен в первую строку с кодом, которая является доступной сразу после заголовка. Когда применяется такой код? Он используется в первую очередь, когда вы должны вводить или выполнять любые действия без необходимости в обновлении ресурса (например, страницы)."
        },
        {
            "name": 205,
            "title": "Reset Content (Сброс контента)",
            "description": "Код обозначает успешную обработку запроса сервером c отсутствующим возвратом контента. В отличие от 204 кода, этот ответ требует, чтобы документ был обновлен. Когда может применяться такой код? Обычно он используется в случаях, заполнения пользователем формы, и отправки сервером браузеру запроса на очистку этой формы. Он имеет сходство с 204 кодом, но выдвигает требование к пользователю по сбросу документа после завершения обработки. К примеру, требуется провести очистку HTML-формы после верификации."
        },
        {
            "name": 206,
            "title": "Partial Reset (Частичный сброс)",
            "description": "Сервер возвращает только часть контента, которая соответствует заголовку, отправленному клиентом. В основном его используют расширенные инструменты кэширования. Такое бывает, когда пользователь хочет получить лишь небольшую часть контента страницы, а сервер в своем ответе предоставляет данные только для этой части страницы. Каковы способы применения этого кода? Преимущественно этот код используется из-за запроса If-Range, применимого в мощных кеш-валидаторах. Обращение также должно включать заголовки областей, которые используются в качестве параметров для области возвращаемой информации."
        },
        {
            "name": 207,
            "title": "Multi-Status (Мультистатус)",
            "description": "Сервер параллельно предоставляет результаты нескольких независимых операций, которые включаются в тело сообщения в виде XML-документа."
        },
        {
            "name": 300,
            "title": "Multiple Choices (Множественный выбор)",
            "description": "Этот код предоставляет пользователю данные о том, что веб-ресурс переместили, и поэтому сервер предлагает пользователю доступные альтернативы, из которых он может выбрать самый релевантный веб-ресурс. В каких случаях будет применен этот ответ сервера? В типичном случае, его можно наблюдать, если сервер получил информацию, что URL-адрес, предоставленный пользователем (иными словами, браузер пользователя), имеет неподходящий индекс и предлагает дополнительный выбор. В обычном порядке такое происходит, когда пользователи применяют URL-адрес к каталогу не последнего уровня, а сервер предлагает им выбор доступных документов или директории последующего уровня."
        },
        {
            "name": 301,
            "title": "Moved Permanently (Удален навсегда)",
            "description": "Это общий запрос пользователя, который означает, что запросы на этот ресурс (а также запросы, которые последуют за ним) следует перенаправить на указанный URL. Когда он используется? Когда страница потеряна, больше не существует, или линк, ведущий на внешний документ, больше неработоспособен. 301 редирект дает пользователю понять, что запрошенный ресурс переместили. В основном он выполняется с помощью файла .htaccess, который доступен на серверах Apache."
        },
        {
            "name": 302,
            "title": "Found (Найден)",
            "description": "Этот код говорит пользователю, что местоположение запрашиваемого веб-документа было временно изменено, а код состояния 302 включает данные о новом размещении, к которому пользователь может делать запрос. Где такой код может применяться? Он имеет несколько форматов использования, большинство из которых соответствуют первоначальному предназначению кода. А вначале он был базовым методом создания временной переадресации. Однако, на сегодняшний день существует несколько других – этичных и неэтичных способов его использования."
        },
        {
            "name": 303,
            "title": "See Other (Смотреть другой)",
            "description": "Он является индикатором того, что искомый ресурс можно найти по URL-адресу, который отличный от того, что указан в запросе. Это не обязательно значит, что ресурс был перемещен. Этот код только предоставляет адрес, который должен запрашиваться при аналогичном ответе. Когда может применяться этот код? Этот способ в основном существует, чтобы позволить выходным файлам POST-активированных скриптов перенаправлять агента пользователя на избранный веб-ресурс."
        },
        {
            "name": 304,
            "title": "Not Modified (Не изменен)",
            "description": "304 означает, что пользователь запрашивает документ / ресурс только тогда, когда он был изменен с момента последних обновлений кеша этого документа. В каких случаях может применяться этот код? Если ответ сервера сообщает вам, что параметры документа If-Modified-Since или If-Match не изменились со времени генерирования последнего кеша. Тогда нет нужды повторно отправлять ресурс на проверку."
        },
        {
            "name": 305,
            "title": "Use Proxy (Использовать прокси)",
            "description": "305 код дает понять пользователю, что доступ к запрашиваемому ресурсу осуществим только через прокси-сервер, указанный в ответе. Когда он показывается? Он часто отображается в связи с мерами безопасности и обеспечивает доступ к запрашиваемым URL-адресам."
        },
        {
            "name": 306,
            "title": "Switch Proxy (Переключить прокси)",
            "description": "Изначально он означал, что «последующие запросы должны использовать указанный прокси», но в настоящее время не используется."
        },
        {
            "name": 307,
            "title": "Temporary Redirect (Временный редирект)",
            "description": "Такой код отображается, если открываемый ресурс временно используется для другого URL-адреса, который также содержится в ответе. 307 немного отличается от 302 кода – он является его более конкретной версией. Когда он используется? Он выводится почти в аналогичных ситуациях, что и при 302, но пользователь должен продолжать запрашивать исходный URL-адрес при следующих запросах или до того времени, пока не будет выведен другой статус сервера."
        },
        {
            "name": 400,
            "title": "Bad Request (Плохой запрос)",
            "description": "Запрос не обрабатывается правильно в связи с синтаксической ошибкой. Для чего предназначен этот код? Если пользователь делает запрос на информацию, но при этом пренебрегает протокольными правилами передачи гипертекста. Запрос не следует делать повторно без надлежащих перемен в синтаксисе."
        },
        {
            "name": 401,
            "title": "Unauthorized (Неавторизирован)",
            "description": "Он имеет отношение к запросу ресурса, который нуждается в авторизации. Код 401 информирует, что предварительную авторизацию отклонили, поскольку переданные пользовательские данные были неверные. Когда он отображается? В случаях, если пользователь делает запрос и использует при этом некорректные входные данные для авторизации (среди них, логин и пароль)."
        },
        {
            "name": 402,
            "title": "Payment Required (Требуется оплата)",
            "description": "Этот код сервера забронирован на будущее. Но, изначально предполагалось, что такой статус можно будет использовать при расчетах специальными формами электронных денег. Но ему так и не нашлось применения. Какова сфера применения этого кода? Старый сервис Apple MobileMe сообщал об 402-ошибке, если аккаунт пользователя в MobileMe подозревался в любой форме злоупотреблений его ресурсами. Также видеохостинг Youtube использует этот статус, если некий IP-адрес использует чрезмерно большое количество запросов. Поэтому пользователю приходится ввести CAPTCHA."
        },
        {
            "name": 403,
            "title": "Forbidden (Запрещен)",
            "description": "Пользователь пробует добиться доступа к веб-ресурсу, на который у него нет прав, а авторизация здесь никак не может помочь. Что насчет применения этого кода? Он используется, когда сервер может понять запрос, но не разрешает выполнить его, поскольку у клиента имеются ограничения доступа к текущему разделу. Обычно такое наблюдается, если веб-ресурс не предназначен для открытого доступа."
        },
        {
            "name": 404,
            "title": "Not Found (Не найден)",
            "description": "Большинство пользователей знакомо с 404 ошибкой. Она указывает на то, что искомый ресурс невозможно найти, но в будущем – когда он может появиться там – к нему можно получить доступ. Также здесь разрешаются все следующие обращения от клиента. Но в большом количестве таких случаев используется код редиректа класса 3xx, и пользователь перенаправляется на альтернативный ресурс или местоположение. Когда демонстрируется этот код? Довольно часто, особенно если страницу удалили или переместили. Часто в таких случаях сервер в автоматическом режиме генерирует доступную страницу с ошибкой 404."
        },
        {
            "name": 405,
            "title": "Method Not Allowed (Метод не разрешен)",
            "description": "Метод, посредством которого осуществляется запрос к ресурсу, является недоступным. Иными словами, появляется ошибка при попытке использовать функцию в формате GET, тогда как требуется ввод данных через метод POST (либо с помощью метода PUT с веб-документами только для чтения). Когда появляется такой статус-код? Ошибки 405 выходят через их отношение со специфическими объектами страницы, для которых и выполнялось обращение к серверу. К примеру, если часть запроса скрипта имеет отличия с запросом пользователя, подразумевавшего применение этого скрипта."
        },
        {
            "name": 406,
            "title": "Not Acceptable (Недопустимо)",
            "description": "Запрашиваемый ресурс имеет возможность генерировать только тот контент, который не может использоваться в Accept-хедерах самого запроса. Браузер может обеспечить сервер характеристиками данных, которые будут приниматься из сервера. В каких случаях такой код может быть использован? В ситуациях, когда форма файла ресурса, который запрашивается не подходит под формат, доступный для распознавания пользователем. Речь здесь идет прежде всего о языке программирования, а не о английском!"
        },
        {
            "name": 407,
            "title": "Proxy Authentication Required (Нужна авторизация прокси)",
            "description": "Как и статус-код 401, значение 407 обозначает, что клиенту следует предварительно авторизоваться через прокси-сервер. Для выполнения этого действия и осуществления процесса авторизации, прокси-сервер должен вернуть поле с заголовком Proxy-authenticate, которое отвечает стандартам, предъявляемым сервером. Когда появляется этот статус-код? В случаях, если сервер «убежден», что запрос данных от клиента является правильным, но получить доступ к веб-ресурсу возможно лишь через авторизацию с помощью прокси-сервера."
        },
        {
            "name": 408,
            "title": "Request Timeout (Тайм-аут запроса)",
            "description": "Истекло время ожидания сервером ретрансляции от клиента. Когда такой статус-код применяться? Используя спецификацию W3 HTTP: «Со стороны клиента не поступало запроса в выделенном временном интервале, когда его ждал сервер. Клиент имеет возможность повторить запрос в любое время»."
        },
        {
            "name": 409,
            "title": "Conflict (Конфликт)",
            "description": "Код 409 является индикатором ситуации, когда запрос не выполняется в связи с противоречивостью обращения к веб-документу. Когда он применятся? Пользователь может получить такой код в случае загрузке файла на веб-сервер, где расположена более поздняя версия этого файла, что приводит к конфликту между версиями в системе управления."
        },
        {
            "name": 410,
            "title": "Gone (Исчез)",
            "description": "Сервер дает подобный ответ, если раньше ресурс находился по определенному URL-адресу, но его удалили и на данный момент он недоступен. Пользователю не следует несколько раз повторять одно и то же самое обращение. Когда применяется такой статус-код? В ситуации, когда уже не представляется возможным получить доступ к ресурсу посредством этого запроса, а на сервере не содержатся данные о гипотетическом местонахождении ресурса. Если сервер подозревает, что веб-документ могут восстановить в ближайшие сроки, то клиенту лучше передать код 404."
        },
        {
            "name": 411,
            "title": "Length Required (Требуется длина)",
            "description": "Запрос не указывает длину контента, и запрашивался в совершенной форме. Когда этот код показывается? Когда браузер не определяет длину запрашиваемого содержимого в заголовке запроса. Сервер не будет принимать запрос без валидного поля заголовка контента."
        },
        {
            "name": 412,
            "title": "Precondition Failed (Сбой предварительного условия)",
            "description": "Сервер не отвечает на одно из предварительных условий, которые отправитель указал в запросе. Иными словами, один или несколько заголовков запросов были возвращены с атрибутом false. Когда этот код может применяться? В случаях, когда заголовок запроса, который делает валидный запрос к ресурсу, сообщает, что это конкретное обращение не применимо к этому конкретному ресурсу."
        },
        {
            "name": 413,
            "title": "Request Entity Too Large (Объект запроса слишком большой)",
            "description": "Код 413 отображается в случаях, когда сервер отказывается обрабатывать запрос, потому что тело запроса слишком велико. Когда этот код может применяться? При использовании метода POST с контентом, который больше по объему, чем сервер, способен обработать."
        },
        {
            "name": 414,
            "title": "Request-URL Too Long (URL запроса слишком длинный)",
            "description": "Этот код отображается, когда сервер не может обработать запрос, потому что указанный URL слишком длинный. Когда этот код может применяться? Когда POST-запрос преобразуется в GET-запрос. POST-запрос поддерживает отправку неограниченного количества данных, объединяя их при обращении к серверу. Однако, если запрос должен быть преобразован в GET-формат, он позволит привязать данные формы к URL-адресу, что даст возможность хранить информацию в больших размерах, чем она была доступна."
        },
        {
            "name": 415,
            "title": "Unsupported Media-Type (Неподдерживаемый тип)",
            "description": "Код 415 отправляется, для указания, что сервер заметил часть запроса, которая была сделана в неподдерживаемом формате. Когда отображается такой код? Когда в запросе не указываются какие-либо типы носителей, поддерживаемые ресурсом или сервером. Например, пользователь запрашивает изображение в расширении, которое не поддерживается веб-сервером. Сервер знает, что запрашивалось, но не понимает формат, в котором хотели получить ресурс."
        },
        {
            "name": 416,
            "title": "416 Requested Range Not Satisfiable (Диапазон не подходит)",
            "description": "Этот ответ пользователь получает, когда он запрашивает часть ресурса, но в то же время этот фрагмент не может быть предоставлен. Когда такой статус может применяться? Когда сервер запрашивает байты XXX-YYY ресурса, но ресурс немного меньше, чем указано при обращениид."
        },
        {
            "name": 417,
            "title": "Expectation Failed (Ошибка ожидания)",
            "description": "Такой статусный ответ получают, когда по какой-то причине сервер не удовлетворяет значение поля Expect заголовка запроса. Когда этот код может применяться? Все абсолютно прозрачно. Когда один из заголовков запросов, заголовок «Expect», получает обращение, на которое сервер не в состоянии ответить."
        },
        {
            "name": 418,
            "title": "I’m a teapot (Я чайник)",
            "description": "Этот код был создан в 1998 году как одна из традиционных шуток на первое апреля IETF, в RFC 2324, как Hyper Text Coffee Pot Control Protocol и вряд ли он когда-нибудь будет обрабатываться современными HTTP-серверами. Может ли он использоваться? Конечно нет, все это было -15 лет назад и делалось ради смеха."
        },
        {
            "name": 419,
            "title": "Authentication Timeout (Тайм-аут аутентификации)",
            "description": "Этого кода нет в RFC 2616, используется в качестве альтернативы коду 401, которые прошли проверку подлинности, но лишены доступа к определённым ресурсам сервера. Обычно код отдается, если CSRF-токен устарел или оказался некорректным."
        },
        {
            "name": 422,
            "title": "Unprocessable Entity (Необрабатываемый объект)",
            "description": "Сервер принял запрос и понял его суть, но не может выполнить обращение из-за содержания в нем некоторых семантических ошибок. Когда используется этот статус-код? Когда на стороне сервера прошло успешное принятие обращения, и сервер способен работать с указанным форматом данных; в теле запроса XML-документ содержит правильные синтаксические конструкции, но также в нем содержится какая-либо логическая ошибка, в связи с которой не представляется возможным управлять ресурсом."
        },
        {
            "name": 423,
            "title": "Locked (Заблокирован)",
            "description": "Целевой ресурс, указанный в запросе, блокируется в связи с применением к нему определенного метода. Чтобы сделать ресурс доступным, следует разблокировать его или предоставить корректные данные авторизации. Когда этот код может применяться? Когда ресурс является закрытым, в основном это делается в целях обеспечения безопасности."
        },
        {
            "name": 424,
            "title": "Failed Dependency (Неудачная зависимость)",
            "description": "424 код сообщает, что выполнение текущего запроса напрямую зависит от успешности другой операции, и если она не будет правильно завершена, то вся обработка запроса остановится."
        },
        {
            "name": 425,
            "title": "Unordered Collection (Неупорядоченная коллекция)",
            "description": "Код 425 показывается пользователю, когда ресурс определяется одним из черновиков расширенного протокола коллекций WebDAV (Advanced Collections Protocol), но отсутствует в Advanced Collections Protocol и Versioning Ordered Collections Protocol."
        },
        {
            "name": 426,
            "title": "Upgrade Required (Нужно обновление)",
            "description": "Этот код показывается, когда сервер дает клиенту инструкции по обновлению протокола (переключения на другой или новый протокол) Когда используется код? Обычно, когда в браузере используются устаревшие протоколы."
        },
        {
            "name": 428,
            "title": "Precondition Required (Требуется предпосылка)",
            "description": "Исходный сервер требует указать предварительные условия при обращении. Этот код разработан во избежание конфликтных версий ресурса в тех ситуациях, когда клиент получает (GET) состояние ресурса, изменяет и отправляет (PUT) его обратно на сервер, и в то же время какая-то третья сторона также изменяет местоположение прямо на севере, что приводит к конфликту. Когда этот код может применяться? По запросу индикации условий, сервер как бы дает гарантии клиентам, что они используют правильную текущую копию ресурса. Если это не совсем так, то пользователь получает ошибку 428."
        },
        {
            "name": 429,
            "title": "Too Many Requests (Слишком много запросов)",
            "description": "Этот ответ отправляется, если со стороны клиента поступало слишком большое количество обращений за короткий промежуток времени. Когда используется этот код? Когда пользователь отправляет слишком много обращений за краткосрочный период."
        },
        {
            "name": 431,
            "title": "Request Header Fields Too Large (Поля заголовков слишком большие)",
            "description": "Появляется, когда сервер не намерен совершать обработку запроса, поскольку какое-нибудь из полей заголовка (или все существующие поля) слишком велики. Когда он применяется? Базово, когда заголовок запроса, поступающий от юзера больше, чем способен обработать сервер. Обращение можно повторить после того, как поля заголовка в нем будут сокращены."
        },
        {
            "name": 444,
            "title": "No Response (Нет ответа)",
            "description": "Используется в лог-файлах сервера Nginx, для указания, что сервер не передавал информацию обратно пользователю и закрыл соединение. Какова сфера применения кода? В основном он использовался как инструмент защиты от вредоносного софта."
        },
        {
            "name": 449,
            "title": "Retry With (Microsoft) (Повторить попытку)",
            "description": "Расширение Microsoft, которое указывает, что запрос следует повторить после завершения соответствующего действия. Когда этот код может применяться? Он часто создается, когда настройки запроса не соответствуют тому, что способен проверить сервер."
        },
        {
            "name": 450,
            "title": "Blocked by Windows Parental Controls – Microsoft (Заблокировано родительским контролем Windows)",
            "description": "Расширение Microsoft. Эта ошибка возникает, когда в параметрах родительского контроля Windows установлена блокировка доступа к некоторым веб-документам. Когда применяется 450 код? В случае, если родители (зная об этой функции) прибегают к использованию родительского контроля, а id-access запросил доступ к заблокированному ресурсу."
        },
        {
            "name": 451,
            "title": "Unavailable For Legal Reasons (Недоступен по юридическим причинам)",
            "description": "Новый HTTP-код статуса для ресурсов, которые заблокированы по юридическим соображениям. Применяется, чтобы указать, что доступ к нужному веб-ресурсу заблокировали по юридическим мотивам: например, посредством цензуры или правительства."
        },
        {
            "name": 500,
            "title": "Internal Server Error (Внутренняя ошибка сервера)",
            "description": "Этот статус сообщает о внутренней ошибке сервера, которая не совпадает с другими ошибками того же класса. Этот код используется, если ресурс или ссылка создается на сервере (например, календарь в системе резервирования), который технически не существует как ссылка или доступный ресурс, но пользователь видите их как ссылки."
        },
        {
            "name": 501,
            "title": "Not Implemented (Не поддерживается)",
            "description": "Сервер либо не понимает метод запроса, либо не поддерживает инструкции, нужные, чтобы обработать обращение. Вы можете столкнуться с указанным кодом 501, когда сервер не имеет поддержки стандартных протоколов запросов, среди которых GET, OPTIONS, HEAD, POST и т. д."
        },
        {
            "name": 502,
            "title": "Bad Gateway (Плохой шлюз)",
            "description": "Пользователь увидит 502 код, если сервер, работает в качестве шлюза или прокси-сервера, и он получил недопустимый ответ от сервера верхнего уровня. Когда используется подобный код? Обычно, когда сервер высшего уровня и прокси / шлюз не согласованы с протоколами, которые представленными в обращении. Как результат появляется ошибка обмена данных."
        },
        {
            "name": 503,
            "title": "Server Unavailable (Сервер недоступен)",
            "description": "Код 503 означает, что возникли технические причины, из-за которых сервер на определенное время не способен обработать набор данных. Его допустимо использовать в случаях, когда на сайт есть повышенный спрос, но у сервера нет возможности обрабатывать все входящие запросы."
        },
        {
            "name": 504,
            "title": "Gateway Timeout (Тайм-аут шлюза)",
            "description": "Сервер как шлюз или прокси-сервер не дождался ответа от вышестоящего сервера, чтобы завершить текущий запрос. Когда этот код может применяться? Когда прокси или шлюз используют как канал передачи данных, а два сервера при этом ожидают на ответ."
        },
        {
            "name": 505,
            "title": "HTTP Version Not Supported (Версия HTTP не поддерживается)",
            "description": "Сервер не поддерживает версию HTTP протокола, обозначенную при обращении к нему. Где используется такой код? В тех случаях, которые были указаны выше! Если HTTP протокол более старый, чем нужно серверу, и, как следствие, он не поддерживается."
        },
        {
            "name": 506,
            "title": "Variant Also Negotiates (Вариант также перенаправляется)",
            "description": "Такой ответ сервера последует, если при оформлении ошибочной конфигурации выбранный параметр указывает сам на себя, что приводит к прерыванию процесса связи. Когда он применяется? Когда сервер настроен неправильно и не может обработать запрос."
        },
        {
            "name": 507,
            "title": "Insufficient Storage (Недостаточно места)",
            "description": "Ошибка 507 имеет место, когда сервер не может разместить данные, поскольку для текущего запроса недостаточно пространства. Этот код может быть применен, когда сервер загружен в полном объеме, а пользователь запрашивает ресурс, который уже имеется в наличии. Трудность здесь заключается в том, что на сервере нет места для хранения отправленных в запросе данных, чтобы отправить запрашиваемый ресурс."
        },
        {
            "name": 509,
            "title": "Bandwidth Limit Exceeded (Превышена пропускная способность)",
            "description": "Этот код ответа используется, когда веб-сайт лимитирует ограничение трафика, предназначенное для него. Когда используется этот статус? Когда Apache запускает правильное расширение, а ISP имеет пропускную способность, которая может быть скоро превышена. Здесь имеется несколько форм ограничения."
        },
        {
            "name": 510,
            "title": "Not Extended (Нет расширения)",
            "description": "Код 510 появляется, когда на сервере нет расширения, которое хочет использовать клиент. Когда этот код появляется? Когда сервер требует больше данных в запросе."
        },
        {
            "name": 511,
            "title": "Network Authentication Required (Требуется аутентификация сети)",
            "description": "Этот статус-код демонстрируется, если клиенту следует сначала авторизоваться в сети, к примеру, необходимо ввести пароль для платного доступа в сеть Интернет. Когда используется этот код? Когда пользователь сначала должен дать свое согласие на условия использования, прежде чем он получит доступ к Интернету (например, к Wi-Fi точке доступа)."
        }
    ],
    "statusesDesc": [
        {
            "name": 100,
            "description": "100 Continue Server Code (Продолжение кода сервера) Код 100 Continue обозначает 'нормальную работу'. Он указывает, что пользователь сделал качественный запрос, и сервер начал его обрабатывать. Это временный код статуса HTTP, появляющийся лишь в тех отдельных случаях, когда пользователь ожидает окончательный ответ со стороны сервера. Он возникает только после отправки последнего пакета данных.Когда такой статус-код можно использовать? Это внутренний статус, бывают случаи, когда он не появляется, особенно если пользователю уже удалось получить некоторые данные из сервера. Это что-то похожее на месседж, в котором сообщается, что соединение установилось качественно, и вы можете зайти на сайт. Отправьте данные, но не забудьте закрыть дверь, когда вы закончите (подразумевается код окончательного ответа)."
        },
        {
            "name": 200,
            "description": "Ответы такого типа уведомляют пользователей о принятии и успешной обработке запросов клиента. Зависимо от того, какой сейчас текущий статус сервера, он все равно может отправлять заголовки и основную часть сообщения. Другими словами, этот тип ответов сервера предполагает, что действие, о котором клиент делал запрос, без сложностей приняли в обработку."
        },
        {
            "name": 300,
            "description": "Этот класс ответов сервера является индикатором дальнейших действий, которые следует выполнить агенту пользователя для того, чтобы закрыть запрос. Пользователи могут либо предпринимать действия, либо посылать разные запросы к серверу."
        },
        {
            "name": 400,
            "description": "Класс ответов 4xx указывает на ошибки на стороне клиента или тот факт, что местоположение никогда (или уже) не существовало."
        },
        {
            "name": 500,
            "description": "Коды 5xx выделены для случаев неудачной работы на стороне сервера. Эти ответы сервера часто отображаются, когда запросы пользователя не могут быть обработаны сервером по той или иной причине. Сервер должен иметь специальное сообщение для браузера, которое должно отображаться пользователю – оно уведомляет, что сервер (по какому-либо поводу) не в состоянии произвести обработку запроса."
        }
    ]
}